server/app/controllers/auth_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "17bcs029@smvdu.ac.in"], ["LIMIT", 1]]
---
  def sign_in
    user = User.find_for_database_authentication(email: params[:email])

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def sign_up
    email = params[:email]
    password = params[:password]
    if email.present? && password.present?
    User.create! email: email, password: password, password_confirmation: password